Revit 2026 API

# LoadComponent Constructor

---

Constructs a new instance of a LoadComponent. The load case or combination id. The load case or combination factor.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public LoadComponent(
	ElementId loadCaseOrCombinationId,
	double factor
)
```
```vb
Public Sub New (
	loadCaseOrCombinationId As ElementId,
	factor As Double
)
```
```cpp
public:
LoadComponent(
	ElementId^ loadCaseOrCombinationId,
	double factor
)
```
```fsharp
new :
        loadCaseOrCombinationId : ElementId *
        factor : float -> LoadComponent
```

#### Parameters

loadCaseOrCombinationId ElementId

factor Double

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

LoadComponent Class

Autodesk.Revit.DB.Structure Namespace